// 2. Вычислить и объяснить:

'use strict'

5 > 4 //true истинно, тк число 5 больше 4

"ананас" >"яблоко"  //false ложно, тк при посимвольном сравнении числовое значение первого же символа 'а' меньше 'я'

"2" > "12" //true истинно, тк при посимвольном сравнении числовое значение первого же символа '2' больше '1'

undefined === null //false ложно, тк типы не совпадают

null == "\n0\n" //false ложно, предполагаю что null преобразуется в строку и стоки разные

null === +"\n0\n" //false ложно, тк типы не совпадают